validation_case/0/N2.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      N2.orig;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.79;


boundaryField
{


    symmetry
    {
        type            empty;
    }

    outerwall
    {
        type            inletOutlet;
        inletValue      uniform 0.79;
        value           uniform 0.79;
    }


    inlet
    {
        type            inletOutlet;
        inletValue      uniform 0.79;
        value           uniform 0.79;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.79;
        value           uniform 0.79;
    }

    sphere
    {
       type            zeroGradient;

    }


    frontAndBackPlanes
    {
        type            empty;
    }


    frontAndBackPlanes_pos
    {
        type            wedge;

    }
    frontAndBackPlanes_neg
    {
        type            wedge;

    }

}


// ************************************************************************* //
