validation_case/0/O2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      O2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
56094
(
0.21
0.21
0.21
0.21
0.21
0.21
0.21
0.21
...
)
;

boundaryField
{
    symmetry
    {
        type            empty;
    }
    outerwall
    {
        type            inletOutlet;
        inletValue      uniform 0.21;
        value           uniform 0.21;
    }
    inlet
    {
        type            inletOutlet;
        inletValue      uniform 0.21;
        value           uniform 0.21;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.21;
        value           uniform 0.21;
    }
    sphere
    {
        type            zeroGradient;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
    frontAndBackPlanes_pos
    {
        type            wedge;
    }
    frontAndBackPlanes_neg
    {
        type            wedge;
    }
}


// ************************************************************************* //
