validation_case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    symmetry
    {
        type            empty;
      //  type            symmetryPlane;
     // type            noSlip;
    }

    outerwall
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }


    inlet
    {
        type    fixedValue;
        //value   uniform (0 0.0 0);
        value   uniform (0 0.0 0);
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);

    }

    sphere
    {
          type            fixedValue;
          value           uniform (0 0 0);

    }


    frontAndBackPlanes
    {
        type            empty;
    }


    frontAndBackPlanes_pos
    {
        type            wedge;

    }
    frontAndBackPlanes_neg
    {
        type            wedge;

    }

}


// ************************************************************************* //
