validation_case/0/pc
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      pc;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{



    symmetry
    {
        type            empty;
     //   type            symmetryPlane;
   //   type            zeroGradient;
    }

    outerwall
    {
        type            zeroGradient;
    }


    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            zeroGradient;

    }

    sphere
    {
        type            zeroGradient;

    }


    frontAndBackPlanes
    {
        type            empty;
    }


    frontAndBackPlanes_pos
    {
        type            wedge;

    }
    frontAndBackPlanes_neg
    {
        type            wedge;

    }

}

// ************************************************************************* //
