validation_case/constant/drgOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

DRG
{
        drg     	off;
        minTemperature  300;
        temperature     1000. 3000.;
        epsilon         0.01  0.001;
        species         (H2 N2 OH);
}

// ************************************************************************* //
