validation_case/constant/pointPriority
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       labelList;
    location    "3e-06";
    object      pointPriority;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

112708{-9223372036854775808}

// ************************************************************************* //
