validation_case/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water air);

water
{
    transportModel  Newtonian;
    nu              nu [0 2 -1 0 0 0 0]  1e-6;
    rho             rho [1 -3 0 0 0 0 0] 1000;
    cp		    cp [ 0 2 -2 -1 0 0 0] 4219;
    lambda	    lambda [1 1 -3 -1 0 0 0] 1.0;
}

air
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1.48e-05;
    rho             [1 -3 0 0 0 0 0] 1.;
    cp              cp  [ 0 2 -2 -1 0 0 0 ] 1000.;
    lambda          lambda [ 1 1 -3 -1 0 0 0 ] 0.026;
}

sigma           sigma [1 0 -2 0 0 0 0] 0.0;
pMin            pMin [1 -1 -2 0 0 0 0] 10000;


// ************************************************************************* //
