validation_case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     4.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices 
(
 (-1 -1 0)         //0
 (-0.25 -1 0)      //1
 (-0.01 -1 0)      //1
 (-0.005 -1 0)
 (0.005 -1 0)
 (0.01 -1 0)      //1
 (0.25 -1 0)      //2
 (1 -1 0)        //3

 (-1 -0.25 0)         //0
 (-0.25 -0.25 0)      //1
 (-0.01 -0.25 0)      //1
 (-0.005 -0.25 0)
 (0.005 -0.25 0)
 (0.01 -0.25 0)      //1
 (0.25 -0.25 0)      //2
 (1 -0.25 0) 


 (-1 -0.01 0)         //0
 (-0.25 -0.01 0)      //1
 (-0.01 -0.01 0)      //1
 (-0.005 -0.01 0)
 (0.005 -0.01 0)
 (0.01 -0.01 0)      //1
 (0.25 -0.01 0)      //2
 (1 -0.01 0) 

 (-1 0 0)         //0
 (-0.25 0 0)      //1
 (-0.005 0 0)
 (0.005 0 0)
 (0.25 0 0)      //2
 (1 0 0) 

 (-1 0.25 0)         //0
 (-0.25 0.25 0)      //1
 (-0.01 0.25 0)      //1
 (-0.005 0.25 0)
 (0.005 0.25 0)
 (0.01 0.25 0)      //1
 (0.25 0.25 0)      //2
 (1 0.25 0) 

 (-1 1 0)         //0
 (-0.25 1 0)      //1
 (-0.01 1 0)      //1
 (-0.005 1 0)
 (0.005 1 0)
 (0.01 1 0)      //1
 (0.25 1 0)      //2
 (1 1 0) 





 (-1 -1 0)         //0
 (-0.25 -1 0)      //1
 (-0.01 -1 0)      //1
 (-0.005 -1 0)
 (0.005 -1 0)
 (0.01 -1 0)      //1
 (0.25 -1 0)      //2
 (1 -1 0)        //3

 (-1 -0.25 0)         //0
 (-0.25 -0.25 0)      //1
 (-0.01 -0.25 0)      //1
 (-0.005 -0.25 0)
 (0.005 -0.25 0)
 (0.01 -0.25 0)      //1
 (0.25 -0.25 0)      //2
 (1 -0.25 0) 


 (-1 -0.01 0)         //0
 (-0.25 -0.01 0)      //1
 (-0.01 -0.01 0)      //1
 (-0.005 -0.01 0)
 (0.005 -0.01 0)
 (0.01 -0.01 0)      //1
 (0.25 -0.01 0)      //2
 (1 -0.01 0) 

 (-1 0 0)         //0
 (-0.25 0 0)      //1
 (-0.005 0 0)
 (0.005 0 0)
 (0.25 0 0)      //2
 (1 0 0) 

 (-1 0.25 0)         //0
 (-0.25 0.25 0)      //1
 (-0.01 0.25 0)      //1
 (-0.005 0.25 0)
 (0.005 0.25 0)
 (0.01 0.25 0)      //1
 (0.25 0.25 0)      //2
 (1 0.25 0) 

 (-1 1 0)         //0
 (-0.25 1 0)      //1
 (-0.01 1 0)      //1
 (-0.005 1 0)
 (0.005 1 0)
 (0.01 1 0)      //1
 (0.25 1 0)      //2
 (1 1 0) 


);


blocks
(
    hex (0 1 7 6 30 31 37 36) (50 50 1) simpleGrading (1 1 1)  //0
    hex (1 2 8 7 31 32 38 37) (100 50 1) simpleGrading (1 1 1)  //1
    hex (2 3 9 8 32 33 39 38) (4 50 1) simpleGrading (1 1 1)  //2
    hex (3 4 10 9 33 34 40 39) (100 50 1) simpleGrading (1 1 1)  //3
    hex (4 5 11 10 34 35 41 40) (50 50 1) simpleGrading (1 1 1)//4
    hex (6 7 13 12 36 37 43 42) (50 100 1) simpleGrading (1 1 1)//5
    hex (7 8 14 13 37 38 44 43) (100 100 1) simpleGrading (1 1 1) //6
    hex (8 9 15 14 38 39 45 44) (4 100 1) simpleGrading (1 1 1) //7
    hex (9 10 16 15 39 40 46 45) (100 100 1) simpleGrading (1 1 1)//8
    hex (10 11 17 16 40 41 47 46) (50 100 1) simpleGrading (1 1 1)//9
    hex (12 13 19 18 42 43 49 48) (50 100 1) simpleGrading (1 1 1)//10
    hex (13 14 20 19 43 44 50 49) (100 100 1) simpleGrading (1 1 1)//11
    hex (15 16 22 21 45 46 52 51) (100 100 1) simpleGrading (1 1 1)//12
    hex (16 17 23 22 46 47 53 52) (50 100 1) simpleGrading (1 1 1)//13
    hex (18 19 25 24 48 49 55 54) (50 50 1) simpleGrading (1 1 1)//14
    hex (19 20 26 25 49 50 56 55) (100 50 1) simpleGrading (1 1 1)//15
    hex (21 22 28 27 51 52 58 57) (100 50 1) simpleGrading (1 1 1)//16
    hex (22 23 29 28 52 53 59 58) (50 50 1) simpleGrading (1 1 1)//17
);



boundary
(
    lowerWall
    {
        type wall;
        faces
        (
            (0 1 30 31)
            (1 2 32 31)
            (2 3 33 32)
            (3 4 34 33)
            (4 5 35 34)
        );
    }
    rightWall
    {
        type wall;
        faces
        (
            (5 11 41 35)
            (11 17 47 41)
            (17 23 53 47)
            (23 29 59 53)
        );
    }
    upperWall
    {
        type wall;
        faces
        (
            (24 25 55 54)
            (25 26 56 55)
            (20 26 56 50)
            (14 20 50 44)
            (14 15 45 44)
            (15 21 51 45)
            (21 27 57 51)
            (27 28 58 57)
            (28 29 59 58)
        );
    }
    leftWall
    {
        type wall;
        faces
        (
            (0 6 36 30)
            (6 12 42 36)
            (12 18 48 42)
            (18 24 54 48)
        );
    }
    
    front
    {
        type empty;
        faces
        (
            (0 1 7 6)
            (1 2 8 7)
            (2 3 9 8)
            (3 4 10 9)
            (4 5 11 10)
            (6 7 13 12)
            (7 8 14 13)
            (8 9 15 14)
            (9 10 16 15)
            (10 11 17 16)
            (12 13 19 18)
            (13 14 20 19)
            (15 16 22 21)
            (16 17 23 22)
            (18 19 25 24)
            (19 20 26 25)
            (21 22 28 27)
            (22 23 29 28)



      );
    }

    back
    {
        type empty;
        faces
        (
            (30 31 37 36)
            (31 32 38 37)
            (32 33 39 38)
            (33 34 40 39)
            (34 35 41 40)
            (36 37 43 42)
            (37 38 44 43)
            (38 39 45 44)
            (39 40 46 45)
            (40 41 47 46)
            (42 43 49 48)
            (43 44 50 49)
            (45 46 52 51)
            (46 47 53 52)
            (48 49 55 54)
            (49 50 56 55)
            (51 52 58 57)
            (52 53 59 58)

      );
    }


);

mergePatchPairs
(
);

// ************************************************************************* //
