validation_case/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
   
// volScalarFieldValue alpha.water 0.0
//volScalarFieldValue H2O 0.
volScalarFieldValue T 360.
volScalarFieldValue O2 0.21
volScalarFieldValue N2 0.79
);


regions
(


    sphereToCell
  {
      
       centre  (0 0 0);   //-0.00022
       radius 0.00035;
  

        fieldValues
        (
         
             //volScalarFieldValue alpha.water 1.0
             //volScalarFieldValue H2O  1.0
             volScalarFieldValue T 360.
             volScalarFieldValue O2 0.0
             volScalarFieldValue N2 0.0


        );

 }



);


// ************************************************************************* //
